Revit 2027 API
RibbonItem Properties
The RibbonItem type exposes the following members.
Properties
Name | Description
Enabled | Gets or sets a value indicating whether the item is enabled.
ItemText | Gets or sets the text displayed on the item.
ItemType | Gets the item type.
LongDescription |  Long description of the command tooltip
Name | The name of the item.
ToolTip | The description that appears as a ToolTip for the item.
ToolTipImage | The image to show as a part of the button extended tooltip
Visible | Gets or sets a value indicating whether the item is visible.
Top
See Also
Reference
RibbonItem Class
Autodesk.Revit.UI Namespace